export interface ReviewItem {
  id: number;
  name: string;
  location: string;
  role?: string;
  comment: string;
  rating: number;
  date: string;
}

export const reviewsList: ReviewItem[] = [
  {
    id: 1,
    name: "রিয়াদ আহমেদ",
    location: "ঢাকা",
    role: "কর্পোরেট প্রফেশনাল",
    comment: "“পেমেন্ট করার সাথে সাথেই ইনস্ট্যান্ট ডাউনলোড লিংক পেয়ে গেছি। আইপ্যাড ও ফোনে পড়ার জন্য টাইপোগ্রাফি ও লেআউট নিখুঁত। সূচিপত্রে ক্লিক করলেই চ্যাপ্টারে চলে যাওয়া যায়!”",
    rating: 5,
    date: "২ দিন আগে"
  },
  {
    id: 2,
    name: "তানভীর হাসান",
    location: "চট্টগ্রাম",
    role: "উদ্যোক্তা",
    comment: "“অসাধারণ প্রাঞ্জল অনুবাদ। যাতায়াতের সময় ফোনে পড়ার জন্য এই পিডিএফ কপিটি দারুণ উপকারে আসছে। মানুষের আচরণ ও সাইকোলজি বুঝতে সবারই এই ডিজিটাল এডিশন পড়া দরকার।”",
    rating: 5,
    date: "৫ দিন আগে"
  },
  {
    id: 3,
    name: "নাহিদ জামান",
    location: "রাজশাহী",
    role: "বিশ্ববিদ্যালয় শিক্ষক",
    comment: "“হাই-রেজোলিউশন ফন্ট হওয়ায় ল্যাপটপে পড়ার সময় চোখের ওপর কোনো চাপ পড়ে না। প্রতিটি নীতি খুব পরিষ্কারভাবে সাজানো। ই-বুক হিসেবে কোয়ালিটি সত্যিই প্রিমিয়াম।”",
    rating: 5,
    date: "১ সপ্তাহ আগে"
  }
];
